Documents/бит_бу_НачисленияПоБиллинговымУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_бу_НачисленияПоБиллинговымУслугам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_бу_НачисленияБиллинговыхУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_бу_СведенияОБиллинговыхУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_бу_СведенияОБиллинговыхУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_бу_НачисленияПоБиллинговымУслугам/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры // ПослеЗаписи()

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	//КэшПеречисления = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("УслугаПустаяСсылка"  , Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	КэшированныеЗначения.Вставить("ЗданиеПустаяСсылка"  , Справочники.бит_СписокЗданий.ПустаяСсылка());
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаКлиенте
Процедура ЛицевыеСчетаСчетАбонентаПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, СтрокаПлатеж.СчетАбонента, "", Истина, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"Субконто1", "Субконто2", "Субконто3");
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетАбонента, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
	"ЛицевыеСчетаСубконто" + Постфикс + "1", 
	"ЛицевыеСчетаСубконто" + Постфикс + "2", 
	"ЛицевыеСчетаСубконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСчетКУПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, СтрокаПлатеж.СчетКУ, "КУ", Ложь, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
	"СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетКУ, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетАбонента);
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоКУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "СубконтоКУ%Индекс%");
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетКУ);
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаСубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма)
	
	СтрокаПлатеж = Форма.Объект.ЛицевыеСчета.НайтиПоИдентификатору(Форма.Элементы.ЛицевыеСчета.ТекущаяСтрока);
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "Субконто%Индекс%");
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "Субконто%Индекс%", "ЛицевыеСчетаСубконто%Индекс%", ПараметрыДокумента); 
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%");
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%", "ЛицевыеСчетаСубконтоКУ%Индекс%", ПараметрыДокумента); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	Для Индекс = 1 По 3 Цикл
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
		КонецЕсли;
	КонецЦикла;
	СписокПараметров.Вставить("ОстаткиОбороты", 1);
	СписокПараметров.Вставить("Организация"   , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//ФормаВыбора = Справочники.бит_СписокЗданий.ПолучитьФормуВыбора(,Элемент);
	//ФормаВыбора.Отбор.Улица.Установить(Объект.Улица,Истина);
	//ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Улица.Доступность = Ложь;
	//
	//ФормаВыбора.Открыть();
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("Улица", Объект.Улица);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Улица = УлицаНаСервере(Объект.Здание);
	
	Если НЕ Улица = Объект.Улица Тогда
		
		//Объект.Здание = Справочники.бит_СписокЗданий.ПустаяСсылка();
		Объект.Здание = мКэшЗначений.ЗданиеПустаяСсылка;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция УлицаНаСервере(Здание)
	
	Возврат Здание.Улица;
	
КонецФункции

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Улица) И ЗначениеЗаполнено(Объект.Здание) Тогда
		ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка);
	Иначе
		Текст = "Перед выбором лицевого счета, укажите: " + 
		?(ЗначениеЗаполнено(Объект.Улица),"","""Улица"""+?(ЗначениеЗаполнено(Объект.Здание),"",", ")) + 
		?(ЗначениеЗаполнено(Объект.Здание),"","""Здание""");
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить(Текст, СтатусСообщения.ОченьВажное);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаБиллинговаяУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	ЛицевойСчет          = СтрокаТаблицы.ЛицевойСчет;
	
	СписокБиллинговоыхУслуг = ПолучитьСписокБиллинговыхУслуг(ЛицевойСчет);
	СтркутураОтбора = Новый Структура("Ссылка", СписокБиллинговоыхУслуг); 
	
	ОткрытьФорму("Справочник.бит_бу_БиллинговыеУслуги.ФормаВыбора", Новый Структура("Отбор", СтркутураОтбора),Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокБиллинговыхУслуг(ЛицевойСчет)
	
	СписокБиллинговоыхУслуг = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(&КонецПериода, ЛицевойСчет = &ЛицевойСчет) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
	|ГДЕ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокБиллинговоыхУслуг.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокБиллинговоыхУслуг;
	
КонецФункции // ПолучитьСписокБиллинговыхУслуг()

&НаКлиенте
Процедура ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка);
	
	СтандартнаяОбработка = Ложь;
	
	//ФормаВыбора = Справочники.бит_ЛицевыеСчета.ПолучитьФормуВыбора(,Элемент,);
	//
	//ФормаВыбора.СправочникСписок.Отбор.УлицаЛицевогоСчета.ВидСравнения = ВидСравнения.Равно;
	//ФормаВыбора.СправочникСписок.Отбор.УлицаЛицевогоСчета.Значение = Объект.Улица;
	//ФормаВыбора.СправочникСписок.Отбор.УлицаЛицевогоСчета.Использование = Истина;
	//
	//ФормаВыбора.СправочникСписок.Отбор.Здание.ВидСравнения = ВидСравнения.Равно;
	//ФормаВыбора.СправочникСписок.Отбор.Здание.Значение = Объект.Здание;
	//ФормаВыбора.СправочникСписок.Отбор.Здание.Использование = Истина;
	//
	//ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.УлицаЛицевогоСчета.Доступность = Ложь;
	//ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Здание.Доступность = Ложь;
	//
	//ФормаВыбора.Открыть();
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("УлицаЛицевогоСчета", Объект.Улица);
	УсловияОтбора.Вставить("Здание"            , Объект.Здание);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаБиллинговаяУслугаПриИзменении(Элемент)
	
	ВызватьЗаполнитьСчета();
	
КонецПроцедуры

&НаСервере
Процедура ВызватьЗаполнитьСчета()
	
	ЗапролнитьСчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		
		Если Не ВыбранноеЗначение = ТекДанные.ЛицевойСчет Тогда
			
			//ТекДанные.Услуга = Справочники.бит_УслугиЖКХ.ПустаяСсылка();
			ТекДанные.Услуга = мКэшЗначений.УслугаПустаяСсылка;
			ТекДанные.Сумма  = 0;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ВыбранноеЗначение = Объект.Здание Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗданиеОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение)), "Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбранноеЗначение = ДополнительныеПараметры.ВыбранноеЗначение;
	
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.ЛицевыеСчета.Очистить();
		Объект.Здание = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОчистка(Элемент, СтандартнаяОбработка)
	
	Ответ = Неопределено;
	
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗданиеОчисткаЗавершение", ЭтотОбъект), "Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОчисткаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.ЛицевыеСчета.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 22.09.2010. 
// Процедура выполняет заполнение счетов и субконто табличной части.
//
// БИТ_ЖКХ 18.08.2014
&НаСервере
Процедура ЗапролнитьСчета()
	
	ДокументОбъект = ДанныеФормыВЗначение(объект, Тип("ДокументОбъект.бит_бу_НачисленияПоБиллинговымУслугам"));
	
	Колонки = ЭтаФорма.Элементы.ЛицевыеСчета.ПодчиненныеЭлементы;
	
	ЛССписок = ДокументОбъект.ЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ДокументОбъект.ЛицевыеСчета, Колонки, ЛССписок, Объект.Организация, Объект.Дата);
	
	ЛицевыеСчета = ДокументОбъект.ЛицевыеСчета.Выгрузить();
	
	Объект.ЛицевыеСчета.Загрузить(ЛицевыеСчета);
	
КонецПроцедуры
// БИТ_ЖКХ 18.08.2014

#КонецОбласти
